Revit 2024 API
Material.SurfaceBackgroundPatternId Property
 The id of the FillPatternElement used as the background pattern of faces with this material in normal views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public ElementId SurfaceBackgroundPatternId { get; set; }
Visual Basic
Public Property SurfaceBackgroundPatternId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ SurfaceBackgroundPatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 The FillPattern used for a background pattern must have a 'Drafting' target.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The element id must represent a valid FillPatternElement. -or- When setting this property: The FillPattern target must be a drafting pattern.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Material Class
Autodesk.Revit.DB Namespace